---
kind: property
id: P:Autodesk.Revit.DB.EdgeArrayArray.IsEmpty
source: html/cb56bc0f-393c-ba63-26a3-31e558650615.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.IsEmpty Property

Test to see if the array is empty.

## Syntax (C#)
```csharp
public virtual bool IsEmpty { get; }
```

## Remarks
If the array is empty then True will be returned, otherwise False.